[{
    "title": "A Treastise on Postmodernism",
    "abstract": "As an exercise to learn more about architectural styles, (and learn something that's a little more organic than the computer science shenanigans I typically get up to) I put together a high level overview of postmodernism.  I'd like to follow up with something on neofuturism in the near future.",
    "body": [{
        "section": "To summarily captivate the essence of the postmodernism movement, Alex Todorow writes in A View from the Campidoglio: “When [he] was young, a sure way to distinguish great architects was through the consistency and originality of their work...This should no longer be the case. Where the Modern masters' strength lay in consistency, ours should lie in diversity.”  This assessment speaks to the cultural trends after the end of the second world war. Coming out of the early 20th century, the industrial revolution was under full swing - leveraging improved economies of scale with respect to manufacturing processes, a trend of homogenous, consistent, and functional elements arose in the arts and architecture."
    }, {
        "section": "Postmodern architecture is largely seen as an American-rooted movement, an extension of sorts from the previous modernism movement, and as such we must examine the roots of the influences which ignited this movement. After the cultural revolution of the sixties which saw the backlash against American involvement in the Vietnam War and the end of segregation laws in the United States - this paradigm shift would slowly gain traction through the sixties and seventies. In a sense, the Postmodernist movement rubber banded back from the simplistic design afforded by these massive scales of production arising from the development of factories earlier in the twentieth century, which lent themselves to reproducing single modular components, which then had a great deal of influence on architects, as the civil engineering efforts involved in executing their designs would skew their decisions - which could be said to be true of just about any civilization. Resource scarcity is certainly a driving factor of their construction processes and aesthetics.  The materials used in construction are still quite similar to that of the modern period, steel framed, with lots of cement.  More glass and open building layouts that lend themselves to collaboration and socialization more so than convenience of formalized form and structure. Thus you might say postmodernism aesthetics juxtapose the modern need for technology, but rather than humans adapting to the technology, the technology and designs should be adapted to human preference. As a consequence of this movement towards more natural environments with open windows and floor plans, natural lighting being quite often exploited. Frank Lloyd Wright and his contemporaries touched on these concepts of this organic symbiosis but the influence of contextualist philosophers on postmodernist thinking, and the recent public outcry for renewable technologies has driven these priorities for a more natural interaction with our world and understanding of the ‘needs of humans’ as the movement progressed."
    }, {
        "section": "Postmodernism swept beyond the borders of the United States - fitting with the explosion of globalism during the same time period. Extending from a post war cultural backlash against the rather functionally simple monolithic cement grey superstructures with orthogonal angles that colored the landscape of modernist architectural aesthetics resulted in a return of ornamental embellishments. While not unnecessarily abstract, one tenet of modernism: ‘form follows function’ was challenged by non-orthogonality, abstract geometric forms that coupled a geographical contextual awareness somewhat reminiscent of Wright’s work, with that of a great deal more artistic liberty."
    }, {
        "section": "One of the first examples of postmodern architecture is that of the Vanna Venturi House, which was designed by Robert Venturi and constructed in Philadelphia, Pennsylvania (1) for his mother in the early sixties. Mario Botta’s coastal Casinò di Campione in Campione d'Italia (2) exhibits these ideals fairly clearly.  You can see the modernist influence on the morphology of the building with a more informal post modernist twist with these abstract offsets, and a contextual awareness of the surrounding geography and architecture. It’s interesting how Botta took into account the cascading apartment complexes along the hill nearby and worked their aesthetic into the front of the casino with gradual elevated levels emulating them on the left and right of the central focus.  Another example is Argentine architect Cesar Pelli’s iconic Petronas Towers (3) in Kuala Lumpur, Malaysia.  The overall design is fairly functional - being a skyscraper, but with some interesting artistic twists. A long fountain walkway resides in front of the towers.  There is also a two story skybridge. They also had the requirement of needing to withstand winds of at least 65 miles per hour, so that was taken into consideration in the design, since they performed a computer simulation, as well as constructing a scale model in a wind tunnel to verify their design was up to par before beginning construction. Another classic example of postmodernist design is Carlo Scarpa’s ‘Brion Cemetery’ (4) which was constructed in the early seventies near Treviso, Italy. While postmodernism is certainly an extension of modernism, the movement signifies a distinct paradigm shift from purely functional spaces in which to live and work;with a breath of deconstructivism aims to bring elements since abandoned by modern architects. Postmodernism combines this recognition of form following function and yet appreciates the aesthetic beauty of aesthetics for its own ornamentality."
    }],
    "date": "October 2016",
    "tags": [{
        "tag": "postmodernism"
    }, {
        "tag": "architecture"
    }, {
        "tag": "rant"
    }]
}, {
    "title": "Piracy and the Digital Economy",
    "body": [{
        "section": "The conversion to digital mediums is rapidly occurring – the widespread growth of high-speed broadband services, as well as the explosion of the use of smart devices, has paved the way for a new digital marketplace.  As with most markets, eventually, there emerges a corresponding black market; specifically, “piracy” – where individuals download files from peer-to-peer networks or direct downloads from FTP servers at little or zero cost to themselves.  Digital piracy, demonstrates a gap in consumer-side market-demand and production-side delivery mediums.  One example being that the time and resources that have been put into pursuit of individuals (for instance, one woman was fined $1.9 million dollars in one case for downloading twenty-four mp3 files (Friend)) accused of pirating copyrighted content, would be better spent reallocated to developing more advanced online digital delivery platforms (thus indirectly solving the problem) akin to iTunes or Netflix – both are widely successful and have been shown to reduce overall impact of downloading.  Digital piracy is certainly detrimental to companies/artists; however, is it possible that it is a by-product of a rapidly evolving landscape?  When there isn’t the availability of a product via condoned means, do people then look to widely available repositories of digital content on the black market?  Is it possible that by reducing or removing many of the perceived benefits of piracy, and, at the same time, offering better access to digital goods, digital piracy would simply disappear?"
    }, {
        "section": "Printed media such as magazines, books and newspapers are losing their relevance due to the fact that tablets and e-readers are becoming commonplace.  There is a great deal of disparity in availability of other electronic content like music, movies, and games. Many new movies are delayed for streaming through Netflix, Hulu or many other means; and many people forget about them.  It could be argued by not making films available via more convenient means that Hollywood forfeits potential earnings.  I’d like to clarify something while we’re addressing the issue of earnings forfeiture – it is said that downloading a movie is theft because it was not paid for. Sometimes we forget that the person who downloaded it wouldn’t have paid for it to begin with. This kind of activity causes a loss of potential future revenue; I argue it is more an issue of copyright infringement and not theft, as nothing is taken. There have been attempts at limiting the transfer of digital purchases from a legitimate owner to another illegitimate owner via Digital Rights Management (DRM) protocols; however, this does little more than create obstacles for legitimate users as most circulated files have been stripped of any DRM prior to transfer. Apple removed all forms of DRM from its audio collection in 2009: 'Beginning today, all four major music labels—Universal Music Group, Sony BMG, Warner Music Group and EMI, along with thousands of independent labels, are now offering their music in iTunes Plus, Apple’s DRM-free format with higher-quality 256 kbps AAC encoding for audio quality virtually indistinguishable from the original recordings.'"
    }, {
        "section": "One example of a problem that exists in the marketplace is the complication with different digital formats and platforms - this makes things difficult for even the legitimate digital consumer. With the licensing of television show/movie rights being exclusively awarded to companies like Amazon, Netflix, Hulu and Apple  – one can’t expect to find everything they want on a single platform.  An article on Forbes.com noted the fact that HBO’s Game of Thrones isn’t available for streaming, “It certainly appears to be the most pirated show of the year,” says John Robinson, a senior media analyst with Big Champagne.”  Online streaming of HBO shows isn’t available except to subscribers to the channel in a cable or satellite package, and piracy of its programming certainly correlates that fact.  The market has spoken – no one wants DVD/CDs, many are moving away from traditional cable, Blu-Ray sales remain strong but the demand for the same material available digitally is greater."
    }, {
        "section": "There is no denying the losses sustained by piracy.  For example, in a study done on the impact of music sales 'concludes that a one percent increase in the music piracy rate results in a 0.6 percent decrease in music sales and that a one percent increase in the Internet penetration rate results in more than a one percent decrease in music sales.'  So there can be little debate as to whether there is a significant economic impact – to cite a study done by Business Software Alliance; “Well over half the world’s personal computer users — 57 percent — admit they acquire pirated software, the Business Software Alliance reported today in the ninth-annual BSA Global Software Piracy Study.” Since we live in America however, the study also goes on to show that the majority of this global piracy occurs in developing countries: “the study found that piracy rates in emerging markets tower over those in mature markets — 68 percent to 24 percent, on average — and emerging markets account for an overwhelming majority of the global increase in the commercial value of software theft.” Of course the sample should be questioned when such a broad proclamation is made. The sample included a survey of roughly fifteen-thousand computer-users in thirty-three countries; so these figures may prove inaccurate as these studies and those similarly funded by giants such as Google, Microsoft and Oracle, have been called on to address the revision of American legislation on copyright protections.  Internationally, the United States has been involved with the Anti-Counterfeiting Trade Agreement, in light of which Ukraine shutdown enormously popular demonoid.com as an offering of goodwill as officials visited the United States this August.  Blockbuster closed a great deal of their stores due to a growing lack of interest in DVDs.  Hollywood Video and Movie Gallery declared bankruptcy in 2010 citing the same downturn in demand.  This could also be attributed to the economic recession, as entertainment is often first on the chopping block for many Americans.  However if that is the case then why have Netflix and Hulu subscriptions soared for example: “Netflix accounts for 29.7% of peak period downstream traffic” according to a published report by ISP1 consultant firm Sandvine. So clearly this is an issue of access, not lack of interest. In light of all this, directly trying to prosecute individuals is enormously expensive and those resources would be better served trying to improve the technologies and digital encryption capabilities to prevent future losses."
    }, {
        "section": "It is entirely conceivable to build such a superior experience that is only available to legitimate users.  The game publisher Valve, owner of the successful Steam service - pioneer of PC game digital downloads has taken a different philosophy than the MPAA1/RIAA2; “One thing that we have learned is that piracy is not a pricing issue. It’s a service issue. The easiest way to stop piracy is not by putting antipiracy technology to work. It’s by giving those people a service that’s better than what they’re receiving from the pirates. For example, Russia: You say, oh, we’re going to enter Russia, people say, you’re doomed, they’ll pirate everything in Russia. Russia now outside of Germany is our largest continental European market.” A similar example of this is Xbox Live; many people “mod” their consoles to allow them to run third-party utilities enabling additional features not supported by the manufacturer and often times involves downloaded games; it is however rather difficult to circumvent Microsoft’s security protocols for Xbox Live to be able to play these games online.  As more games are reliant on multiplayer the benefits of downloading trickle off quickly.  With additional features and ease of access (many hacked/cracked copies of software don’t work well – particularly when combined with networks such as Xbox Live and Steam) – as well as an economic model allowing for higher profit margins as storefront costs are cut in the internet era, there are a growing multitude of reasons to simply use the legitimate method of obtaining digital media."
    }, {
        "section": "The lengths some of the companies have gone to in their efforts to combat piracy is bordering on the absurd, DMCA1 takedown requests are spiraling out of control, “another request sent on behalf of 20th Century Fox for “How I Met Your Mother”. The DMCA notice lists a CBS URL as the official source of the copyrighted material, but the same URL later appears in the list of infringing links.” High speed internet providers have gotten into the arena by implementing monthly bandwidth caps.  Allowing only a specified amount of data travel to your home in a month – the idea being that high bandwidth users are pirates (or Netflix subscribers!).  An example discussed by Harvard Business Review: “For example: let's say you're a Comcast subscriber. If you watch Saturday Night Live using Netflix, it counts towards your download limit, watch that very same show using the very same internet connection, but use Comcast's Xfinity app instead — and now, suddenly, the download limit doesn't count.” There have even been discussions of banning people merely ACCUSED (not tried and convicted in a court of law) of copyright infringement being banned from their respective internet service provider as a result.  Which isn’t to say that I’m personally against measures being taken to protect intellectual property – I simply ask whether we still live in America; land of the free?  The draconian measures proposed by recent bills COICA2, SOPA3, PIPA4, CISPA5 cross a line – and are clearly developed without the interests of the American public in mind but rather the interests of the ‘tech oligarchy’.  There has been broad resistance against these bills as all have failed – save but one, CISPA passed approval by the United States House of Representatives in April 2012, and would allow for information to be shared between technology companies and government agencies.  Local news in South Bend, IN reports: “Critics say the controversial bills had many unintended consequences and challenged them as an infringement on the First Amendment right of free speech. According to protesters, such legislation could shut down any website for having one small portion of copyrighted material — no matter how innocent the use.” Perhaps instead of focusing these efforts on legislation, more could take a lead from Valve’s example with their Steam marketplace and improve their paying customer’s experiences by such a large margin to that of an illegitimate copy – and the masses would flock to use such a service."
    }, {
        "section": "In summary, rather than directly addressing piracy through legislation, the prosecution of individuals, by censorship or other means, how about improving the experience and availability to consumers? There are few who would deny the necessity to deal with the issues associated with piracy; however, is it worth destroying the very nature that allowed the Internet to proliferate?  Since its inception by DARPA1 and rapid adoption by universities and then the rest of the world, the fact that ANYONE with an internet connection is able to publish their ideas and collaborate with the global community at large – and this has been allowed by the nonrestrictive nature of the web.  Technology is evolving too rapidly to accurately predict its flow, and rather than supporting a few giants leftover from the cable era, progress should be protected to allow for innovation to continue revolutionizing our culture in the way it already has.  I hope to soon see a universal platform for my media contents, to freely access everything from my PC, laptop, phone, tablet as well as some amount of ability to integrate family members’ devices into my network as well.  A true home cloud would be ideal, rather than having to integrate several sometimes incompatible technologies.  Further development of technologies would allow for increased security over copyrighted content to protect investments and revenues.  Also to be considered as we move towards widespread cloud networking, the potential to lose out on most of the benefits of whatever software for example would be greatly diminished unless you were of the small minority that is capable of hacking their servers to connect your illegitimate copy.  Everyone benefits by better technologies allowing greater ease of access – consider how many smart streaming devices (Apple TV, Boxee, smart TVs, Internet-connected Blu-Ray players) are in American homes now.  Digital delivery is the future that has already arrived; whether big business gets on board or not will be the test of strength as to whether they will endure into maturity of the digital millennium."
    }],
    "date": "February 2013",

    "tags": [{}],

    "sources": [{
        "source": "Allworth, James. Havard Business Review HBR Blog Network. 7 December 2012. 7 December 2012 <http://blogs.hbr.org/cs/2012/12/how_corruption_is_strangling_us_innovation.html>."
    }, {
        "source": "Apple, Inc. Apple - Press Info - Changes Coming to the iTunes Store. 06 January 2009. 11 November 2012 <http://www.apple.com/pr/library/2009/01/06Changes-Coming-to-the-iTunes-Store.html>."
    }, {
        "source": "Bender, Mark T. and Yongsheng Wang. 'The Impact of Digital Piracy on Music Sales: A cross-country analysis.' International Social Science Review 2009: 157-170."
    }, {
        "source": "Business Software Alliance (BSA). Well Over Half the World's Computer Users Admit Pirating Software, BSA Study Finds. Press Release. Washington, DC, 2012."
    }, {
        "source": "Friend, Elianne. CNN Justice. 18 June 2009. 21 October 2012 <http://articles.cnn.com/2009-06-18/justice/minnesota.music.download.fine_1_jury-instructions-fined-sheryl-crow?_s=PM:CRIME>."
    }, {
        "source": "Gray, Amanda. 'Legislators say anti-piracy bills too broad.' South Bend Tribune 28 Jan 2012."
    }, {
        "source": "Greenberg, Andy. Forbes. 9 May 2012. 14 October 2012 <http://www.forbes.com/sites/andygreenberg/2012/05/09/hbos-game-of-thrones-on-track-to-be-crowned-most-pirated-show-of-2012/>."
    }, {
        "source": "Newell, Gabe. kalekold.net. 9 September 2012. 14 October 2012 <http://www.kalekold.net/index.php?post=22>."
    }, {
        "source": "Sandvine. Global Phenoma Report. Market Research. Waterloo, Ontario: Sandvine, Incorporated, 2011."
    }, {
        "source": "TorrentFreak. TorrentFreak. 3 December 2012. 9 December 2012 <http://torrentfreak.com/movie-studios-ask-google-to-censor-their-own-films-facebook-and-wikipedia-121203/>.}]"
    }]
}, {
    "title": "Future Reality: A New Hope",
    // "abstract": "My goal with this post is to collect ",
    "body": [{
        "section": "While mixed reality is on the cusp of going mainstream - the theory seems to be there, but the physical reality for many applications doesn't seem quite ready from where I'm sitting. I'm excited about the future of the industry but, the first release of the hololens for example, leaves a lot to be desired. Things like the Kinect, and the Leap Motion are both fascinating devices but still difficult to work with. Despite that, I'm convinced once enough of the tumblers fall into place, there will certainly be another information revolution much like the Gutenberg printing press, typewriter, the internet, mixed reality will have a similarly profound impact on the masses and how we communicate, and other experiences. Perhaps that's old news, and the real question we should be asking ourselves is, what the hell will we do with this new medium? That's where we'll see the real potential for disruption, once things are 'robust' putting it in the hands of content creators." 
    }, {
        "section": "Visualizations can allow for intuitive analysis of complex tasks, and thus allows one to leverage this lower cognitive load in order to apply more creativity in understanding / discovering things not immediately apparent by simply reading a dataset or crunching the numbers. If two or more people were able to manipulate and interact with 4D visualizations in a shared environment, this would push many activities to another level. Imagine learning about the solar system in elementary school exploring a virtual universe with your classmates and teachers as a holographic experience there in the classroom. Or perhaps gamification of puzzles and other interesting problems that are difficult to solve, like <a href=\"http://fold.it/portal/\">Foldit</a>."
    }],
    "date": "February 2017",

    "tags": [{"tag": "virtual reality"}, {"tag": "mixed reality"}, {"tag": "visualization"}]
}]