[
    {
        "title": "A Treastise on Postmodernism",
        "body": "To summarily captivate the essence of the postmodernism movement, Alex Todorow writes in A View from the Campidoglio: 'When [he] was young, a sure way to distinguish great architects was through the consistency and originality of their work...This should no longer be the case. Where the Modern masters' strength lay in consistency, ours should lie in diversity.'  This assessment speaks to the cultural trends after the end of the second world war. Coming out of the early 20th century, the industrial revolution was under full swing - leveraging improved economies of scale with respect to manufacturing processes, a trend of homogenous, consistent, and functional elements arose in the arts and architecture. Postmodern architecture is largely seen as an American-rooted movement, an extension of sorts from the previous modernism movement, and as such we must examine the roots of the influences which ignited this movement. After the cultural revolution of the sixties which saw the backlash against American involvement in the Vietnam War and the end of segregation laws in the United States - this paradigm shift would slowly gain traction through the sixties and seventies. In a sense, the Postmodernist movement rubber banded back from the simplistic design afforded by these massive scales of production arising from the development of factories earlier in the twentieth century, which lent themselves to reproducing single modular components, which then had a great deal of influence on architects, as the civil engineering efforts involved in executing their designs would skew their decisions - which could be said to be true of just about any civilization. Resource scarcity is certainly a driving factor of their construction processes and aesthetics.  The materials used in construction are still quite similar to that of the modern period, steel framed, with lots of cement.  More glass and open building layouts that lend themselves to collaboration and socialization more so than convenience of formalized form and structure. Thus you might say postmodernism aesthetics juxtapose the modern need for technology, but rather than humans adapting to the technology, the technology and designs should be adapted to human preference. As a consequence of this movement towards more natural environments with open windows and floor plans, natural lighting being quite often exploited. Frank Lloyd Wright and his contemporaries touched on these concepts of this organic symbiosis but the influence of contextualist philosophers on postmodernist thinking, and the recent public outcry for renewable technologies has driven these priorities for a more natural interaction with our world and understanding of the ‘needs of humans’ as the movement progressed. Postmodernism swept beyond the borders of the United States - fitting with the explosion of globalism during the same time period. Extending from a post war cultural backlash against the rather functionally simple monolithic cement grey superstructures with orthogonal angles that colored the landscape of modernist architectural aesthetics resulted in a return of ornamental embellishments. While not unnecessarily abstract, one tenet of modernism: ‘form follows function’ was challenged by non-orthogonality, abstract geometric forms that coupled a geographical contextual awareness somewhat reminiscent of Wright’s work, with that of a great deal more artistic liberty. One of the first examples of postmodern architecture is that of the Vanna Venturi House, which was designed by Robert Venturi and constructed in Philadelphia, Pennsylvania (1) for his mother in the early sixties. Mario Botta’s coastal Casinò di Campione in Campione d'Italia (2) exhibits these ideals fairly clearly.  You can see the modernist influence on the morphology of the building with a more informal post modernist twist with these abstract offsets, and a contextual awareness of the surrounding geography and architecture. It’s interesting how Botta took into account the cascading apartment complexes along the hill nearby and worked their aesthetic into the front of the casino with gradual elevated levels emulating them on the left and right of the central focus.  Another example is Argentine architect Cesar Pelli’s iconic Petronas Towers (3) in Kuala Lumpur, Malaysia.  The overall design is fairly functional - being a skyscraper, but with some interesting artistic twists. A long fountain walkway resides in front of the towers.  There is also a two story skybridge. They also had the requirement of needing to withstand winds of at least 65 miles per hour, so that was taken into consideration in the design, since they performed a computer simulation, as well as constructing a scale model in a wind tunnel to verify their design was up to par before beginning construction. Another classic example of postmodernist design is Carlo Scarpa’s ‘Brion Cemetery’ (4) which was constructed in the early seventies near Treviso, Italy. While postmodernism is certainly an extension of modernism, the movement signifies a distinct paradigm shift from purely functional spaces in which to live and work; with a breath of deconstructivism aims to bring elements since abandoned by modern architects.  Postmodernism combines this recognition of form following function and yet understands the aesthetic beauty of aesthetics for its ornamental sake.",
        "link": "https://github.com/rivulet-zhang/Twitter-Navigator",
        "date": "April 2015 - current",
        "tags": [{"tag": "javascript"}, {"tag":"python"}, {"tag":"web development"}]
    }
]