[{
    "title": "Social Media Analytics and Reporting Toolkit (SMART)",
    "description": [{
        "section": "TwitIE Named Entity Recongition system research and evaluation - developed Java API on top of GATE Embedded w/TwitIE for automation of entity extraction in microblog corpora"
    }, {
        "section": "Twitter Email Alert Response - I implemented a geo-filter to allow for multiple polygon entities encoded in shapefiles to allow users to set up real-time email alerts based on matching tweets according to named entity recognition described above"
    }, {
        "section": "Built a backend RESTful server for constructing a 'Natural Scale Tree' relating census data in a hierarchical manner. This includes parsing shapefiles and constructing a tree of polygon entities in a MongoDB collection to allow for intersection querying, polygon simplification / offset buffering"
    }, {
        "section": "Implemented downloadable reports of various data points in CSV or JSON format"
    }, {
        "section": "Our development team received a Certificate of Merit awarded by the U.S. Coast Guard for the system’s contributions to public service"
    }],
    "tags": [{
        "tag": "javascript"
    }, {
        "tag": "python"
    }, {
        "tag": "java"
    }, {
        "tag": "web development"
    }],
    "link": "https://www.cerias.purdue.edu/research/projects/home/detail/175/social_media_analytics_and_reporting_toolkit_smart",
    "dates": "December 2014 - current"
}, {
    "title": "PixelTone",
    "description": [{
        "section": "PixelTone is a webapp facilitating the uploading of pictures to be analyzed by Microsoft’s Project Oxford DeepVision API to determine possible emotional indicators of people in the images, coupled with work that extracts a dominant color palette to be considered as input parameters to procedurally generate music fitting the input image’s ‘vibe’ through use of a knowledge base constructed with domain knowledge of harmony and rhythm, coupled with genetic evolutionary algorithms to produce a song in MIDI file format to be returned to the front end view and a displayed score for the user to follow along with."
    }, {
        "section": "Recognized by Purdue’s Computer Science department as an exceptional project Spring 2016"
    }],
    "tags": [{
        "tag": "machine learning"
    }, {
        "tag": "procedural generation"
    }, {
        "tag": "audio"
    }],
    "link": "https://github.com/bmahlbrand/PixelTone",
    "dates": "January 2016 - May 2016"
}, {
    "title": "Impromptune",
    "description": [{
        "section": "a Java application extending on the feature set of Zong! viewer, while also implementing a dynamic music generation based on the current loaded musical score. We took a static musicXML score viewer and added many features to it while using a Scrum software development methodology."
    },{
        "section": "My contributions were mainly an underlying API coupling the Zong API and handling MusicXML input (as the Zong! API isn't complete), and using Hidden Markov Models coupled with some boosting techniques to generate interesting music with multiple voices / instruments via JFugue (a Java based MIDI library)"
    }],
    "tags": [{
        "tag": "machine learning"
    }, {
        "tag": "procedural generation"
    }, {
        "tag": "audio"
    }],
    "link": "https://github.com/phill117/Impromptune",
    "dates": "January 2015 - May 2015"
}, {
    "title": "VAST Challenge 2015",
    "description": [{
        "section": "Led the back end server development team. Utilized Apache Solr for fast indexing and retrieving large scale trajectory and network data.Established a python based data server that allows the client to query Solr system using a Python Bottle RESTful API "
    }, {
        "section": "Implemented Restful APIs that provides functionality for k-means, KDE and group trajectory clustering, in addition to spatial & temporal filtering / sampling."
    }, {
        "section": "Explored graph based tweet clustering algorithms based on optimal modularity scores, a greedy random walk of optimal modularity, K cores, and edge betweenness, co-occurrence of words, phrase co - occurrence and semantic role labeling with parse trees to build edges between entities and actions. Topic graph caching for hierarchical term exploration."        
    }, {
        "section": "We submitted 3 short papers to each of the challenges. Received an Honorable Mention for our paper and accompanying visualization system submitted for the VAST Challenge 2015 - Mini Challenge 2."
    }],
    "tags": [{
        "tag": "machine learning"
    }, {
        "tag": "topic modelling"
    }, {
        "tag": "python"
    }, {
        "tag": "backend"
    }],
    "link": "http://vacommunity.org/VAST+Challenge+2015",
    "dates": "June 2015 - July 2015"
}, {
    "title": "Purdue Cognition & Learning Laboratory",
    "description": [{
        "section": "worked on a long term project towards a ‘smart’ digital tutor with automated relevance scoring of written responses using QuickScore (developed by collaborators at Indiana University) and adaptive lag adjustment according to user performance, users can upload their own materials, developed new version with a MEAN (MongoDB, Express, Angular, NodeJS) stack, previously built with Play Framework in Java and MySQL"
    }, {
        "section": "automated deployment of  web experiments using PHP, MySQL, Javascript (AngularJS / D3js) to allow researchers to use a configuration file to dynamically create highly customized recall/retrieval tasks to collect data through Amazon MTurk without the need for programming experience, later built a MEAN stack to replace the PHP based framework"
    }],
    "tags": [{
        "tag": "JavaScript"
    }, {
        "tag": "NodeJS"
    }, {
        "tag": "PHP"
    }, {
        "tag": "MongoDB"
    }, {
        "tag": "MySQL"
    }],
    "link": "http://learninglab.psych.purdue.edu/",
    "dates": "June 2015 - April 2015"
}, {
    "title": "VR Asteroids Gaze",
    "description": [{
        "section": "I built this in a few hours for a VR experience similar to the class Asteroids game - sans player thrusters, as the issues with motion sickness would be pretty excaberated in a 3D free fall situation like that."
    }, {
        "section": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/y9FCDd72vFQ\" frameborder=\"0\" allowfullscreen></iframe>"
    }],
    "tags": [{
        "tag": "Occulus Rift"
    }, {
        "tag": "Unreal Engine"
    }, {
        "tag": "WebVR"
    }, {
        "tag": "Blueprints"
    }]
}, {
    "title": "VR Warp Menu Maze w/AI and physics actors demo",
    "description": [{
        "section": "I built this riffing on standard assets available with Unreal Engine in order to procedurally generate a shooting gallery tower by means of blueprints"
    }, {
        "section": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/QeXl3zZf3Ow\" frameborder=\"0\" allowfullscreen></iframe>"
    }],
    "tags": [{
        "tag": "Occulus Rift"
    }, {
        "tag": "Unreal Engine"
    }, {
        "tag": "WebVR"
    }, {
        "tag": "blueprints"
    }, {
        "tag": "procedural generation"
    }]
}, 
{
    "title": "query-by-humming engine",
    "description": [{
        "section": "Information Search and Management final research project in developing a query by humming system to detect hummed melodies and match likely songs, using auto correlation, damerau levenshtein, and wuManber edit distance algorithms"
    }],
    "tags": [{
        "tag": "Java"
    }, {
        "tag": "MIDI"
    }, {
        "tag": ".wav"
    }, {
        "tag": "audio"
    }],
    "link": "https://github.com/bmahlbrand/queryByHumming",
    "dates": "November - December 2014"
}, {
    "title": "Fiz / Flip",
    "description": [{
        "section": "an interpreter shell for a simple functional language (in the spirit of LISP) from scratch written in C++ with Flex and Bison"
    }],
    "tags": [{
        "tag": "functional programming"
    }, {
        "tag": "C++"
    }, {
        "tag": "flex / bison parser"
    }],
    "link": "",
    "dates": "October 2015"
}, {
    "title": "Systems Programming / OS projects",
    "description": [{
        "section": "solaris timeshare / round robin process schedulers"
    }, {
        "section": "mark and sweep garbage collector for the Xinu operating system"
    }, {
        "section": "MyHTTPD: a web server implemented with threads, thread pooling, and process pooling operating modes written in C/C++ supporting dynamicly loaded libraries"
    }, {
        "section": "BenShell: A robust alternative to bash Unix shell written in C++"
    }],
    "tags": [{
        "tag": "C"
    }, {
        "tag": "C++"
    }, {
        "tag": "flex / bison parser"
    }],
    "link": "",
    "dates": "Spring / Fall 2015"
}, {
    "title": "Oracle FastR",
    "description": [{"section": "I was involved in an implementation of GNU-R to Oracle FastR, porting C / Fortran to Java to mirror R functionality within Oracle's FastR implementation, which leverages Graal and Truffle to achieve speed improvements over GNU-R. The focus of my work was implementing Oracle FastR language's built-in vector/matrix operations in their database products for optimal performance."}],
    "tags": [{
        "tag": "Java"
    }, {
        "tag": "R"
    }, {
        "tag": "data analytics"
    }],
    "dates": "April - August 2014"
}, {
    "title": "C / C++ networking",
    "description": [{
        "section": "IPv4/IPv6 packet dumper for TCP, UDP, ARP, ICMP packets, multithreaded inflection server, concurrent FTP server, SDN data center simulation / multi-tenant flow restrictions"
    }],
    "tags": [{
        "tag": "Python"
    }, {
        "tag": "C / C++"
    }, {
        "tag": "socket programming"
    }],
    "link": "",
    "dates": "Spring 2016"
}, {
    "title": "Software Rasterizer",
    "description": [{
        "section": "Built and extended a software rasterizer from scratch for rendering triangles, ray tracing, clipping, depth masking, texture mapping, model space/screen space interpolation, hard / soft shadows, projective textures, reflections, refractions, depth imposters for reflections"
    }],
    "tags": [{
        "tag": "OpenGL"
    }, {
        "tag": "C++"
    }],
    "link": "",
    "dates": "Spring 2016"
}, {
    "title": "Purdue EPICS (Engineering Projects In Community Service, APPS - TADA)",
    "description": [{"section": "TADA (Technology Assisted Dietary Assessment) Android application aims to provide a simple way to track your daily diet, provide recommendations, while researchers working with project advisor Dr. Edward Delp and VIPER lab students gather geo-tagged data and nutritional habits."}, {"section": "Implemented functionality to allow multiple UPC barcodes, images of meals to be batch processed by server to determine nutritional content for users"},{"section": "Implemented a local datastore for client side caching of personal dietary history."}],
    "tags": [{"tag": "Android"}, {"tag": "Java"}, {"tag": "geo-location"}],
    "link": "http://www.tadaproject.org/",
    "dates": "Spring 2014"
}, {
    "title": "MonkeyMan",
    "description": [{
        "section": "Wave spawning FPS Android game built with Unity to learn basics of programming / game development"
    }],
    "tags": [{"tag": "JavaScript"}, {"tag": "C#"}],
    "link": "https://github.com/bmahlbrand/monkeyman",
    "dates": "June 2013 - July 2013"
}]